caseFiles/sFoam3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    conductingwall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (0 3 2 1)
            (4 5 6 7)
            
        );
    }
    top 
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
